# data = "2018-12-18 00:00:00,粤B4C0N7,121749,1545062175000,1545062402000,15.0,3.38,2.499,6.635,0:0:5,1,ffffffffffffffffffff,0.0,114.12190166666667,22.572741666666666,114.111825,22.587381666666666,269,246"
# data_split = data.split(",")
# for i in range(len(data_split)):
#     print(i,data_split[i])

# with open(r"D:\subwayData\mutiOD\TaxiODFlow\20181201\part-00000","r") as fin:
#     lines = fin.readlines()
#     for line in lines:
#         if line[-1] == "\n":
#             line = line[:-1]
#             line_split = line.split(",")
#             if line_split[1] == "93" and line_split[3] == "89":
#                 print(line)

strs = "251008708,南山,2018-01-01T15:53:17.000Z,113.92359513313055,22.524017933756355,2018-01-01T16:34:59.000Z,沙井,113.82444768067496,22.73085930950438,0,0.0,0.0,0.0,0.0,南山;113.92359513313055;22.524017933756355;沙井;113.82444768067496;22.73085930950438,251008708;2018-01-01T15:53:17.000Z;南山;113.92359513313055;22.524017933756355;IGT-130;-;-;-;-;3;2018-01-01T16:34:59.000Z;沙井;113.82444768067496;22.73085930950438;OGT-106;Sub;4"
str_split = strs.split(",")
for i in range(len(str_split)):
    print(i,str_split[i])